import '../models/dish.dart';

final List<Dish> mockMeals = [
  Dish(
    id: "0",
    name: "Тосты с Яичницей",
    calories: 100,
    description: "Хрустящие тосты с жареными яйцами, подаются горячими.",
    ingredients: ["Хлеб", "Яйца", "Масло", "Соль", "Перец"],
  ),
  Dish(
    id: "1",
    name: "Плов с курицей",
    calories: 1000,
    description: "Традиционный плов с ароматным рисом и сочной курицей.",
    ingredients: ["Рис", "Курица", "Морковь", "Лук", "Чеснок", "Приправы"],
  ),
  Dish(
    id: "2",
    name: "Плов с курицей",
    calories: 1000,
    description: "Традиционный плов с ароматным рисом и сочной курицей.",
    ingredients: ["Рис", "Курица", "Морковь", "Лук", "Чеснок", "Приправы"],
  ),
  Dish(
    id: "2",
    name: "Кофе с Маффином",
    calories: 1000,
    description: "Свежесваренный кофе и сладкий шоколадный маффин.",
    ingredients: ["Кофе", "Молоко", "Сахар", "Маффин", "Шоколад"],
  ),
  Dish(
    id: "2",
    name: "Цезарь с Креветками",
    calories: 1000,
    description: "Классический салат Цезарь с хрустящими креветками.",
    ingredients: ["Креветки", "Салат Романо", "Сухарики", "Пармезан", "Соус Цезарь"],
  ),
];
